app/views/projects/index.html.erb

    <tr><strong><%= project.title %></strong></tr>
  <% project.todos.each do |todo| %>
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = ?  [["project_id", 1]]

        <%= form.text_field :text %>
     <p><%= form.collection_select :id, Project.all, :id, :title %></p>
---
SELECT "projects".* FROM "projects"