app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)


    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "123"], ["created_at", "2018-03-02 12:52:27.255241"], ["updated_at", "2018-03-02 12:52:27.255241"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", ""], ["updated_at", "2018-03-05 19:36:55.716883"], ["id", 7]]